## Pandas DataFrame overview
A DataFrame represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc.).The DataFrame has both a row and column index

In [4]:
import pandas as pd

In [5]:
fruit_No1=pd.Series([1,2,3,4,5])
fruit_No2=pd.Series([5,4,3,2,1])
print(fruit_No1,fruit_No2)

0    1
1    2
2    3
3    4
4    5
dtype: int64 0    5
1    4
2    3
3    2
4    1
dtype: int64

In [6]:
fruit_No1=pd.Series([1,2,3,4,5])
fruit_No2=pd.Series([5,4,3,2,1])
fruit_Names=pd.Series(["apple","grapes","banana", "orange"])
print(fruit_No1,fruit_No2, fruit_Names )

0    1
1    2
2    3
3    4
4    5
dtype: int64 0    5
1    4
2    3
3    2
4    1
dtype: int64 0     apple
1    grapes
2    banana
3    orange
dtype: object

In [7]:

pd.DataFrame({"fruit_No1":fruit_No1, "fruit_No2":fruit_No2, "fruit_Names":fruit_Names})

   fruit_No1  fruit_No2 fruit_Names
0          1          5       apple
1          2          4      grapes
2          3          3      banana
3          4          2      orange
4          5          1         NaN

In [8]:
fruit_Chaat= {"fruit_No1":fruit_No1, "fruit_No2":fruit_No2, "fruit_Names":fruit_Names}
pd.DataFrame(fruit_Chaat)

   fruit_No1  fruit_No2 fruit_Names
0          1          5       apple
1          2          4      grapes
2          3          3      banana
3          4          2      orange
4          5          1         NaN

In [9]:
Mix_fruit=pd.DataFrame(fruit_Chaat)
Mix_fruit

   fruit_No1  fruit_No2 fruit_Names
0          1          5       apple
1          2          4      grapes
2          3          3      banana
3          4          2      orange
4          5          1         NaN

# Recalling indexes, we can apply indexes explicitly

In [10]:
fruit_No1=pd.Series([1,2,3,4,5], ["a", "b", "c", "d", "e"] ) 
fruit_No1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [11]:
fruit_No2=pd.Series([5,4,3,2,1], index=["one", "two", "three", "four", "five"])
fruit_No2

one      5
two      4
three    3
four     2
five     1
dtype: int64

In [12]:
print(fruit_No1, fruit_No2)

a    1
b    2
c    3
d    4
e    5
dtype: int64 one      5
two      4
three    3
four     2
five     1
dtype: int64

# What if both series have different indexes like what we did above?

In [16]:
fruit_No1=pd.Series([1,2,3,4,5], ["a", "b", "c", "d", "e"] ) 
fruit_No2=pd.Series([5,4,3,2,1], index=["one", "two", "three", "four", "five"])


fruit_Chaat = {"fruit_No1": fruit_No1, "fruit_No2": fruit_No2}
Mix_fruits = pd.DataFrame(fruit_Chaat)
print(Mix_fruits)
#Mix_fruit
# index not matched

       fruit_No1  fruit_No2
a            1.0        NaN
b            2.0        NaN
c            3.0        NaN
d            4.0        NaN
e            5.0        NaN
five         NaN        1.0
four         NaN        2.0
one          NaN        5.0
three        NaN        3.0
two          NaN        4.0

# In the above example if we print Mix_fruit with using print, it doesnt show manual indexes

In [17]:
Mix_fruit

   fruit_No1  fruit_No2 fruit_Names
0          1          5       apple
1          2          4      grapes
2          3          3      banana
3          4          2      orange
4          5          1         NaN

# If we keep indexes same for both series

In [20]:
fruit_No1=pd.Series([1,2,3,4,5], ["one", "two", "three", "four", "five"]) 
fruit_No2=pd.Series([5,4,3,2,1], index=["one", "two", "three", "four", "five"])

fruit_Chaat = {"fruit_No1": fruit_No1, "fruit_No2": fruit_No2}
Mix_fruits = pd.DataFrame(fruit_Chaat)
print(Mix_fruits)
#
# index not matched

       fruit_No1  fruit_No2
one            1          5
two            2          4
three          3          3
four           4          2
five           5          1

# Passing List into a dictionary, then passing that dictionary to pandas dataframe

In [43]:
data={"Name":["Naila","Anum", "Sana","Saira", "Saima", "Anila"], "RollNo":['7','5','3','1','4','6'], 'Grade':['A','B','C','D','E','F']}
pd.DataFrame(data, index=["1st", "2nd", "3rd", "4th", "5th", "6th"])

      Name RollNo Grade
1st  Naila      7     A
2nd   Anum      5     B
3rd   Sana      3     C
4th  Saira      1     D
5th  Saima      4     E
6th  Anila      6     F

# we can convert a dictionary to dataframe by using from_dict method

In [44]:
pd.DataFrame.from_dict(data)

    Name RollNo Grade
0  Naila      7     A
1   Anum      5     B
2   Sana      3     C
3  Saira      1     D
4  Saima      4     E
5  Anila      6     F

# We can use column argument to view the sequence of columns as we want

In [46]:
pd.DataFrame(data, columns=['RollNo', 'Name', 'Grade'])

  RollNo   Name Grade
0      7  Naila     A
1      5   Anum     B
2      3   Sana     C
3      1  Saira     D
4      4  Saima     E
5      6  Anila     F

# To view alongwith index(what we defined)

In [47]:
pd.DataFrame(data, columns=['RollNo', 'Name', 'Grade'],  index=["1st", "2nd", "3rd", "4th", "5th", "6th"])

    RollNo   Name Grade
1st      7  Naila     A
2nd      5   Anum     B
3rd      3   Sana     C
4th      1  Saira     D
5th      4  Saima     E
6th      6  Anila     F

# To assign above dataframe onto a variable and use head method

In [48]:
std_class=pd.DataFrame(data, columns=['RollNo', 'Name', 'Grade'],  index=["1st", "2nd", "3rd", "4th", "5th", "6th"])

In [49]:
std_class.head()   # bydefault Head function used for displayed 1st 5 rows

    RollNo   Name Grade
1st      7  Naila     A
2nd      5   Anum     B
3rd      3   Sana     C
4th      1  Saira     D
5th      4  Saima     E

In [50]:
std_class.head(2) #We can pass argument in head method

    RollNo   Name Grade
1st      7  Naila     A
2nd      5   Anum     B

In [52]:
#We can display index and column names as well
print(std_class.columns)
print( std_class.index )

Index(['RollNo', 'Name', 'Grade'], dtype='object')
Index(['1st', '2nd', '3rd', '4th', '5th', '6th'], dtype='object')

In [53]:
std_class.columns

Index(['RollNo', 'Name', 'Grade'], dtype='object')

# A column in a DataFrame can be retrieved as a Series either by 
# 1. dictionary-like notation    or 
# 2. by Attribute:

# 1. Dictionary-like notation to access or extract

In [54]:
std_class["RollNo"]

1st    7
2nd    5
3rd    3
4th    1
5th    4
6th    6
Name: RollNo, dtype: object

# 2. To access or extract by Attribute:

In [55]:
std_class.RollNo

1st    7
2nd    5
3rd    3
4th    1
5th    4
6th    6
Name: RollNo, dtype: object

# To find the location of specific row,"Loc" method is used

In [56]:
std_class.loc['2nd']

RollNo       5
Name      Anum
Grade        B
Name: 2nd, dtype: object

In [57]:
std_class.loc['6th']

RollNo        6
Name      Anila
Grade         F
Name: 6th, dtype: object

In [58]:
std_class.head()

    RollNo   Name Grade
1st      7  Naila     A
2nd      5   Anum     B
3rd      3   Sana     C
4th      1  Saira     D
5th      4  Saima     E

#Lets assign this dataframe with one extra  'Marks'added and assign this dataframe to another variable(remember RollNo,Name and Grade are the lists that were passed in dictionary and then dataframe). This new column 'Marks'has no list

In [65]:
std_class2=pd.DataFrame(data, columns=['RollNo', 'Name', 'Grade', 'Marks'],  
             index=["1st", "2nd", "3rd", "4th", "5th", "6th"])
#print(std_class2)
std_class2

    RollNo   Name Grade Marks
1st      7  Naila     A   NaN
2nd      5   Anum     B   NaN
3rd      3   Sana     C   NaN
4th      1  Saira     D   NaN
5th      4  Saima     E   NaN
6th      6  Anila     F   NaN

# displaying index and columns names

In [66]:
print(std_class2.columns)
print( std_class2.index )

Index(['RollNo', 'Name', 'Grade', 'Marks'], dtype='object')
Index(['1st', '2nd', '3rd', '4th', '5th', '6th'], dtype='object')

# Columns can be modified by assigning a value. For example, the empty 'Marks' column could be assigned a scalar value or an array values:

In [74]:
std_class2['Marks']=60
#std_class2.Marks= 60

In [75]:
std_class2.head(2)

    RollNo   Name Grade  Marks
1st      7  Naila     A     60
2nd      5   Anum     B     60

In [77]:
val = pd.Series([95, 80, 85, 70], index=['1st', '2nd', '4th', '5th'])

std_class2['Marks'] = val  # Adding values in "Marks" column 
std_class2

    RollNo   Name Grade  Marks
1st      7  Naila     A   95.0
2nd      5   Anum     B   80.0
3rd      3   Sana     C    NaN
4th      1  Saira     D   85.0
5th      4  Saima     E   70.0
6th      6  Anila     F    NaN

# Deleting data (row or column) from dataframe

In [101]:
import numpy as np
import pandas as pd

random = np.arange(30)
print(random)

[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
 24 25 26 27 28 29]

In [102]:
NmPy_Data = np.arange(30).reshape((5, 6))
NmPy_Data

array([[ 0,  1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10, 11],
       [12, 13, 14, 15, 16, 17],
       [18, 19, 20, 21, 22, 23],
       [24, 25, 26, 27, 28, 29]])

# We can assign numpy values to dataframe and then can assign to variable numpydataframe (NmPy_Datafrm)

In [107]:
NmPy_Datafrm = pd.DataFrame(np.arange(30).reshape((5, 6)),   # random generate values
             index=['R1', 'R2', 'R3', 'R4', 'R5'],
             columns=['Col1', 'Col2', 'Col3', 'Col4', 'Col5', 'Col6'])
NmPy_Datafrm

    Col1  Col2  Col3  Col4  Col5  Col6
R1     0     1     2     3     4     5
R2     6     7     8     9    10    11
R3    12    13    14    15    16    17
R4    18    19    20    21    22    23
R5    24    25    26    27    28    29

# Deleting columns from dataframe

In [108]:
#You can drop values from the columns by passing axis=1 or axis='columns' :

In [111]:
NmPy_Datafrm=NmPy_Datafrm.drop('Col3', axis=1, inplace = True)
NmPy_Datafrm

AttributeError: 'NoneType' object has no attribute 'drop'

# Deleting specific rows from DataFrame

In [112]:
NmPy_Datafrm = pd.DataFrame(np.arange(30).reshape((5, 6)),   # random generate values
             index=['R1', 'R2', 'R3', 'R4', 'R5'],
             columns=['Col1', 'Col2', 'Col3', 'Col4', 'Col5', 'Col6'])
NmPy_Datafrm

    Col1  Col2  Col3  Col4  Col5  Col6
R1     0     1     2     3     4     5
R2     6     7     8     9    10    11
R3    12    13    14    15    16    17
R4    18    19    20    21    22    23
R5    24    25    26    27    28    29

In [117]:
NmPy_Datafrm.drop('R4',axis=0, inplace= True)

In [118]:
NmPy_Datafrm

    Col1  Col2  Col3  Col4  Col5  Col6
R1     0     1     2     3     4     5
R2     6     7     8     9    10    11
R3    12    13    14    15    16    17
R5    24    25    26    27    28    29

# Selection with loc and iloc (Used in slicing data)

In [119]:
NmPy_Datafrm = pd.DataFrame(np.arange(30).reshape((5, 6)),   # random generate values
             index=['R1', 'R2', 'R3', 'R4', 'R5'],
             columns=['Col1', 'Col2', 'Col3', 'Col4', 'Col5', 'Col6'])
NmPy_Datafrm

    Col1  Col2  Col3  Col4  Col5  Col6
R1     0     1     2     3     4     5
R2     6     7     8     9    10    11
R3    12    13    14    15    16    17
R4    18    19    20    21    22    23
R5    24    25    26    27    28    29

# loc() function helps to select specific rows or columns based on row or column labels

In [122]:
print(NmPy_Datafrm.loc[['R4', 'R5'], ['Col3','Col4']])

    Col3  Col4
R4    20    21
R5    26    27

#iloc() function helps to select specific rows or columns based on their integer position values

In [124]:
print(NmPy_Datafrm.iloc[1: 4, [3, 0, 1] ] )     # using number instead of labels
                
            # iloc does row wise operation

    Col4  Col1  Col2
R2     9     6     7
R3    15    12    13
R4    21    18    19

In [126]:
print(NmPy_Datafrm.iloc[: 4, [5, 3, 2, 1] ] )

    Col6  Col4  Col3  Col2
R1     5     3     2     1
R2    11     9     8     7
R3    17    15    14    13
R4    23    21    20    19

In [127]:
print(NmPy_Datafrm.iloc[:])

    Col1  Col2  Col3  Col4  Col5  Col6
R1     0     1     2     3     4     5
R2     6     7     8     9    10    11
R3    12    13    14    15    16    17
R4    18    19    20    21    22    23
R5    24    25    26    27    28    29

In [128]:
print(NmPy_Datafrm.iloc[:3, :3])

    Col1  Col2  Col3
R1     0     1     2
R2     6     7     8
R3    12    13    14

In [129]:
print(NmPy_Datafrm.iloc[:, :3])

    Col1  Col2  Col3
R1     0     1     2
R2     6     7     8
R3    12    13    14
R4    18    19    20
R5    24    25    26

# Arithmetic methods with 'fill value'

In [133]:
df1 = pd.DataFrame(np.arange(12).reshape((3, 4)),
                   columns=list('abcd'))

df2 = pd.DataFrame(np.arange(20).reshape((4, 5)),
                    columns=list('abcde'))
print(df1)

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [134]:
print(df2)

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [135]:
df3 = df1+df2
print(df3)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [136]:
# Add method is used for filling NaN cells with a value
# In dataframe 'df2' Nan will be replaced by 0 and then 'Add' method will applied
df3 = df1.add(df2, fill_value=0)
print(df3)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0